# Aron Baugh
## Week 13 4/25/2021
### Python - Pandas DataFrame - Grouping and Mapping

In [1]:
import numpy as np
from pandas import Series,DataFrame
import pandas as pd

In [2]:
#mapping
df = DataFrame({'city':['Alma','Brian Head','Fox Park','Lake Mary'],
               'altitude':[10355,9800,9062,8966]})

df

         city  altitude
0        Alma     10355
1  Brian Head      9800
2    Fox Park      9062
3   Lake Mary      8966

In [4]:
st_map={'Alma':'Colorado','Brian Head':'Utah','Fox Park':'Wyoming','Lake Mary':'California'}
st_map

{'Alma': 'Colorado',
 'Brian Head': 'Utah',
 'Fox Park': 'Wyoming',
 'Lake Mary': 'California'}

In [5]:
df['state'] = df['city'].map(st_map)
df

         city  altitude       state
0        Alma     10355    Colorado
1  Brian Head      9800        Utah
2    Fox Park      9062     Wyoming
3   Lake Mary      8966  California

In [6]:
#apply
def meter(x):
    return x / 3.3808

In [7]:
df['altitude']=df['altitude'].apply(meter)

df

         city     altitude       state
0        Alma  3062.884524    Colorado
1  Brian Head  2898.722196        Utah
2    Fox Park  2680.430667     Wyoming
3   Lake Mary  2652.035021  California

In [9]:
df = DataFrame(np.random.randn(4,3),columns=list('bde'),
              index=['UT','OH','TX','OR'])

df

           b         d         e
UT -0.397545  0.889480  2.087195
OH -0.555749 -0.047795 -0.651737
TX -0.553390 -0.800571 -1.128656
OR  0.032389  1.528678 -1.478918

In [10]:
def dif(x):
    return x.max() - x.min()

In [11]:
df.apply(dif)

b    0.588138
d    2.329250
e    3.566113
dtype: float64

In [12]:
df.apply(dif,axis=1)

UT    2.484740
OH    0.603941
TX    0.575265
OR    3.007596
dtype: float64

In [13]:
df.apply(pd.value_counts).fillna(0)

             b    d    e
-1.478918  0.0  0.0  1.0
-1.128656  0.0  0.0  1.0
-0.800571  0.0  1.0  0.0
-0.651737  0.0  0.0  1.0
-0.555749  1.0  0.0  0.0
-0.553390  1.0  0.0  0.0
-0.397545  1.0  0.0  0.0
-0.047795  0.0  1.0  0.0
 0.032389  1.0  0.0  0.0
 0.889480  0.0  1.0  0.0
 1.528678  0.0  1.0  0.0
 2.087195  0.0  0.0  1.0

In [14]:
#groupby
df = DataFrame({'k1':['a','a','b','b','c'],
               'k2':['one','two','one','two','one'],
               'dataset1':np.random.randn(5),
               'dataset':np.random.randn(5)})
df

  k1   k2  dataset1   dataset
0  a  one  0.121212  0.663669
1  a  two  1.397143  0.567580
2  b  one  1.452316 -0.650186
3  b  two  0.623575 -0.941836
4  c  one  0.744503 -2.150111

In [15]:
df.groupby('k1').count()

    k2  dataset1  dataset
k1
a    2         2        2
b    2         2        2
c    1         1        1

In [16]:
df.groupby('k1').size()

k1
a    2
b    2
c    1
dtype: int64

In [18]:
df.groupby(['k1','k2']).count()

        dataset1  dataset
k1 k2
a  one         1        1
   two         1        1
b  one         1        1
   two         1        1
c  one         1        1

In [20]:
df['dataset1'].groupby(df['k1']).mean()

k1
a    0.759177
b    1.037946
c    0.744503
Name: dataset1, dtype: float64

In [21]:
df.groupby('k1').mean()

    dataset1   dataset
k1
a   0.759177  0.615625
b   1.037946 -0.796011
c   0.744503 -2.150111

In [22]:
df.groupby(['k1','k2']).mean()

        dataset1   dataset
k1 k2
a  one  0.121212  0.663669
   two  1.397143  0.567580
b  one  1.452316 -0.650186
   two  0.623575 -0.941836
c  one  0.744503 -2.150111

In [23]:
group = df.groupby(['k1','k2'])[['dataset1']]

group.mean()

        dataset1
k1 k2
a  one  0.121212
   two  1.397143
b  one  1.452316
   two  0.623575
c  one  0.744503